---
kind: method
id: M:Autodesk.Revit.DB.ScheduleSortGroupField.#ctor(Autodesk.Revit.DB.ScheduleFieldId)
source: html/e9d75d26-71e7-08d6-2fec-a8a906a8ac13.htm
---
# Autodesk.Revit.DB.ScheduleSortGroupField.#ctor Method

Creates a new ScheduleSortGroupField.

## Syntax (C#)
```csharp
public ScheduleSortGroupField(
	ScheduleFieldId fieldId
)
```

## Parameters
- **fieldId** (`Autodesk.Revit.DB.ScheduleFieldId`) - The ID of the field that the schedule will be sorted or grouped by.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null